tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
    if (ep_config & IO_FIDO) {
        uint8_t fido_desc_size = sizeof(FidoDesc);
        memcpy(ActiveCfgDesc + ActiveCfgDescSize, FidoDesc, fido_desc_size);
        ActiveCfgDesc[ActiveCfgDescSize + 2] = num_iface;
        FidoInterfaceNum = num_iface;
        num_iface++;
        ActiveCfgDescSize += fido_desc_size;
    }

    if (ep_config & IO_CCID) {
        uint8_t ccid_desc_size = sizeof(CcidDesc);
        memcpy(ActiveCfgDesc + ActiveCfgDescSize, CcidDesc, ccid_desc_size);
        ActiveCfgDesc[ActiveCfgDescSize + 2] = num_iface;
        CcidInterfaceNum = num_iface;
        num_iface++;
        ActiveCfgDescSize += ccid_desc_size;
    }

    if (ep_config & IO_DEBUG) {
        uint8_t debug_desc_size = sizeof(DebugDesc);
        memcpy(ActiveCfgDesc + ActiveCfgDescSize, DebugDesc, debug_desc_size);
        ActiveCfgDesc[ActiveCfgDescSize + 2] = num_iface;
        DebugInterfaceNum = num_iface;
        num_iface++;
        ActiveCfgDescSize += debug_desc_size;
    }

    ActiveCfgDesc[2] = ActiveCfgDescSize;
    ActiveCfgDesc[4] = num_iface;
}

/*******************************************************************************
 * Function Name  : Config_Uart1(uint8_t *cfg_uart)
 * Description    : Configure serial port 1 parameters
 * Input          : Serial port configuration parameters Four bit baud rate, stop bit, parity, data bit
 * Output         : None
 * Return         : None
 *******************************************************************************/
void Config_Uart1(uint8_t *cfg_uart)
{
    uint32_t uart1_baud = 0;
    *((uint8_t*) &uart1_baud) = cfg_uart[0];
    *((uint8_t*) &uart1_baud + 1) = cfg_uart[1];
    *((uint8_t*) &uart1_baud + 2) = cfg_uart[2];
    *((uint8_t*) &uart1_baud + 3) = cfg_uart[3];
    SBAUD1 = 256 - FREQ_SYS / 16 / uart1_baud;   // SBAUD1 = 256 - Fsys / 16 / baud rate
    IE_UART1 = 1; // Enable UART1 interrupt
}


int anything_busy(void) {
    if(Endpoint2UploadBusy || Endpoint3UploadBusy || Endpoint4UploadBusy || UsbEp2ByteCount || UsbEp3ByteCount || UsbEp4ByteCount) {
         return 1;
    }
    return 0;
}


void usb_irq_setup_handler(void)
{
    uint16_t len = USB_RX_LEN;
    printStrSetup("Setup ");

    if (len == (sizeof(USB_SETUP_REQ))) {
        SetupLen = ((uint16_t) UsbSetupBuf->wLengthH << 8) | (UsbSetupBuf->wLengthL);
        len = 0; // Defaults to success and uploading 0 length
        SetupReq = UsbSetupBuf->bRequest;

        // Class-Specific Requests, i.e. HID request, CDC request etc.
        if ( ((UsbSetupBuf->bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_CLASS) ||
             ((UsbSetupBuf->bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_VENDOR)) {

            printStrSetup("Class/Vendor-Specific Request = ");
            printNumU8HexSetup(SetupReq);
            printStrSetup("\n\t");

            switch(SetupReq) {
            case USB_HID_REQ_TYPE_GET_REPORT:
                printStrSetup("HID GET_REPORT\n");
                break;
            case USB_HID_REQ_TYPE_GET_IDLE:
                printStrSetup("HID GET_IDLE\n");
                break;
            case USB_HID_REQ_TYPE_GET_PROTOCOL:
                printStrSetup("HID GET_PROTOCOL\n");
                break;
            case USB_HID_REQ_TYPE_SET_REPORT:
                printStrSetup("HID SET_REPORT\n");
                break;
            case USB_HID_REQ_TYPE_SET_IDLE:
                printStrSetup("HID SET_IDLE\n");
                break;
            case USB_HID_REQ_TYPE_SET_PROTOCOL:
                printStrSetup("HID SET_PROTOCOL\n");
                break;
            case USB_CDC_REQ_TYPE_SET_LINE_CODING:
                printStrSetup("CDC SET_LINE_CODING\n");
                break;
            case USB_CDC_REQ_TYPE_GET_LINE_CODING:
                printStrSetup("CDC GET_LINE_CODING\n");
                pDescr = LineCoding;
                len = sizeof(LineCoding);
                SetupLen = MIN(SetupLen, len); // Limit total length
                len = (SetupLen >= DEFAULT_EP0_SIZE) ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                memcpy(Ep0Buffer, pDescr, len); // Copy upload data
                SetupLen -= len;
                pDescr += len;
                break;
            case USB_CDC_REQ_TYPE_SET_CONTROL_LINE_STATE:
                printStrSetup("CDC SET_CONTROL_LINE_STATE\n");
                break;
            default:
                printStrSetup("Unsupported Request!\n");
                len = 0xFF; // Unsupported Request
                break;
            } // END switch(SetupReq)
        } // END Class/Vendor-Specific Requests

        // Standard Request
        else if (((UsbSetupBuf->bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_STANDARD)) {

            printStrSetup("Standard Request = ");
            printNumU8HexSetup(SetupReq);
            printStrSetup("\n\t");

            switch (SetupReq) {
            case USB_GET_DESCRIPTOR:
                printStrSetup("GET_DESCRIPTOR: wValueH = ");
                printNumU8HexSetup(UsbSetupBuf->wValueH);
                printStrSetup("\n\t\t");

                switch (UsbSetupBuf->wValueH) {
                case USB_DESC_TYPE_DEVICE:
                    printStrSetup("DEVICE\n");
                    pDescr = DevDesc; // Send the device descriptor to the buffer to be sent
                    len = sizeof(DevDesc);
                    SetupLen = MIN(SetupLen, len); // Limit total length
                    len = (SetupLen >= DEFAULT_EP0_SIZE) ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                    memcpy(Ep0Buffer, pDescr, len); // Copy upload data
                    SetupLen -= len;
                    pDescr += len;
                    break;

                case USB_DESC_TYPE_DEVICE_QUALIFIER:
                    printStrSetup("DEVICE_QUALIFIER\n");
                    break;

                case USB_DESC_TYPE_CONFIGURATION:
                    printStrSetup("CONFIGURATION\n");
                    pDescr = ActiveCfgDesc; // Send the configuration descriptor to the buffer to be sent
                    len = ActiveCfgDescSize; // Dynamic value based on what endpoints are enabled
                    SetupLen = MIN(SetupLen, len); // Limit total length
                    len = (SetupLen >= DEFAULT_EP0_SIZE) ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                    memcpy(Ep0Buffer, pDescr, len); // Copy upload data
                    SetupLen -= len;
                    pDescr += len;
                    break;

                case USB_DESC_TYPE_STRING:
                    printStrSetup("STRING: wValueL = ");
                    printNumU8HexSetup(UsbSetupBuf->wValueL);
                    printStrSetup("\n\t\t\t");

                    if (UsbSetupBuf->wValueL == USB_IDX_LANGID_STR) {
                        printStrSetup("LangDesc\n");
                        pDescr = LangDesc;
                        len = sizeof(LangDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_MFC_STR) {
                        printStrSetup("ManufDesc\n");
                        pDescr = ManufDesc;
                        len = sizeof(ManufDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_PRODUCT_STR) {
                        printStrSetup("ProdDesc\n");
                        pDescr = ProdDesc;
                        len = sizeof(ProdDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_SERIAL_STR) {
                        printStrSetup("SerialDesc\n");
                        pDescr = SerialDesc;
                        len = sizeof(SerialDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_CDC_CTRL_STR) {
                        printStrSetup("CdcCtrlInterfaceDesc\n");
                        pDescr = CdcCtrlInterfaceDesc;
                        len = sizeof(CdcCtrlInterfaceDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_CDC_DATA_STR) {
                        printStrSetup("CdcDataInterfaceDesc\n");
                        pDescr = CdcDataInterfaceDesc;
                        len = sizeof(CdcDataInterfaceDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_FIDO_STR) {
                        printStrSetup("FidoHidInterfaceDesc\n");
                        pDescr = FidoInterfaceDesc;
                        len = sizeof(FidoInterfaceDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_CCID_STR) {
                        printStrSetup("CcidInterfaceDesc\n");
                        pDescr = CcidInterfaceDesc;
                        len = sizeof(CcidInterfaceDesc);
                    } else if (UsbSetupBuf->wValueL == USB_IDX_INTERFACE_DEBUG_STR) {
                        printStrSetup("DebugInterfaceDesc\n");
                        pDescr = DebugInterfaceDesc;
                        len = sizeof(DebugInterfaceDesc);
                    } else {
                        printStrSetup("Unknown String!\n");
                        len = 0xFF; // Unsupported
                        break;      // Early exit
                    }
                    SetupLen = MIN(SetupLen, len); // Limit total length
                    len = (SetupLen >= DEFAULT_EP0_SIZE) ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                    memcpy(Ep0Buffer, pDescr, len); // Copy upload data
                    SetupLen -= len;
                    pDescr += len;
                    break;

                case USB_DESC_TYPE_HID:
                    printStrSetup("HID: wValueL = ");
                    printNumU8HexSetup(UsbSetupBuf->wValueL);
                    printStrSetup("\n");

