tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
uint8_t uart_byte_count()
{
    uint8_t in = UartRxBufInputPointer;
    uint8_t out = UartRxBufOutputPointer;

    if (in >= out) {
        return (in - out);
    } else {
        return (UART_RX_BUF_SIZE - (out - in));
    }
}

// Copy data from a circular buffer

void circular_copy(uint8_t *dest, const uint8_t *src, size_t src_size, size_t start_pos, size_t length) {
    if (!dest || !src || start_pos >= src_size || length > src_size) return;

    size_t remaining_space = src_size - start_pos;

    if (length <= remaining_space) {
        memcpy(dest, src + start_pos, length);
    } else {
        memcpy(dest, src + start_pos, remaining_space);
        memcpy(dest + remaining_space, src, length - remaining_space);
    }
}


// Function to increment a pointer and wrap around the buffer
uint32_t increment_pointer(uint32_t pointer, uint32_t increment, uint32_t buffer_size)
{
    return (pointer + increment) % buffer_size;
}

// Function to decrement a pointer and wrap around the buffer
uint32_t decrement_pointer(uint32_t pointer, uint32_t decrement, uint32_t buffer_size)
{
    return (pointer + buffer_size - (decrement % buffer_size)) % buffer_size;
}

void cts_start(void)
{
    gpio_p1_5_unset(); // Signal to FPGA to send more data
}

void cts_stop(void)
{
    gpio_p1_5_set(); // Signal to FPGA to not send more data
}

void check_cts_stop(void)
{
    if (uart_byte_count() >= 133) // UartRxBuf is filled to 95% or more
    {
        cts_stop();
    }
}


// int check_content(uint8_t *buf, size_t size) {
//
//     uint8_T expected[] = {0x52, 0x02, 0x74, 0x6B, 0x31, 0x20, 0x6D, 0x6B, 0x64, 0x66, 0x06, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
//
//
//
//
// }

void main()
{
    CfgFsys();     // CH559 clock selection configuration
    mDelaymS(5);   // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
#ifdef DEBUG_PRINT_HW
    mInitSTDIO();  // Serial port 0, can be used for debugging
#endif
    UART1Setup();  // For communication with FPGA
    UART1Clean();  // Clean register from spurious data

    printStrSetup("\nStartup\n");

    uint8_t ActiveEndpoints = RESET_KEEP;

    // Always enable CDC endpoint
    if ((ActiveEndpoints & IO_CDC) == 0x0) {
        ActiveEndpoints |= IO_CDC;
    }

    // Always enable CH552 endpoint
    if ((ActiveEndpoints & IO_CH552) == 0x0) {
        ActiveEndpoints |= IO_CH552;
    }

    // FIDO and CCID can't be enabled at the same time. Disable both!
    if ((ActiveEndpoints & IO_FIDO) && (ActiveEndpoints & IO_CCID)) {
        ActiveEndpoints &= ~(IO_FIDO | IO_CCID);
    }

    CreateCfgDescriptor(ActiveEndpoints);

    USBDeviceCfg();
    USBDeviceEndPointCfg(); // Endpoint configuration
    USBDeviceIntCfg();      // Interrupt initialization

    UEP0_T_LEN = 0;         // Transmit length must be cleared (Endpoint 0)
    UEP1_T_LEN = 0;         // Transmit length must be cleared (Endpoint 1)
    UEP2_T_LEN = 0;         // Transmit length must be cleared (Endpoint 2)
    UEP3_T_LEN = 0;         // Transmit length must be cleared (Endpoint 3)
    UEP4_T_LEN = 0;         // Transmit length must be cleared (Endpoint 4)

    gpio_init_p1_4_in();    // Init GPIO p1.4 to input mode for FPGA_CTS
    gpio_init_p1_5_out();   // Init GPIO p1.5 to output mode for CH552_CTS
    cts_start();            // Signal OK to send

    uint8_t delay = 0;

    while (1) {

        if(anything_busy()) {
            UEP0_CTRL = UEP_R_RES_NAK | UEP_T_RES_NAK;
        } else {
            UEP0_CTRL = set_ep0;
        }

        if (UsbConfig) {


            // Check if Endpoint 2 (CDC) has received data
            if (UsbEp2ByteCount) {
                Ep2ByteLen = UsbEp2ByteCount; // UsbEp2ByteCount can be maximum 64 bytes
                // memcpy(UartTxBuf, Ep2Buffer, Ep2ByteLen);

                CH554UART1SendByte(IO_CDC);  // Send CDC mode header
                CH554UART1SendByte(Ep2ByteLen);  // Send length
                // CH554UART1SendBuffer(UartTxBuf, Ep2ByteLen);
                CH554UART1SendBuffer(Ep2Buffer, Ep2ByteLen);
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 2 to ACK again
                UsbEp2ByteCount = 0;
            }

            // Check if Endpoint 3 (FIDO or CCID) has received data
            if (UsbEp3ByteCount) {
                Ep3ByteLen = UsbEp3ByteCount; // UsbEp3ByteCount can be maximum 64 bytes
                // memcpy(UartTxBuf, Ep3Buffer, Ep3ByteLen);

                if (ActiveEndpoints & IO_FIDO) {
                    CH554UART1SendByte(IO_FIDO); // Send FIDO mode header
                } else if (ActiveEndpoints & IO_CCID) {
                    CH554UART1SendByte(IO_CCID); // Send CCID mode header
                }
                CH554UART1SendByte(Ep3ByteLen); // Send length (always 64 bytes for FIDO, variable for CCID)
                // CH554UART1SendBuffer(UartTxBuf, Ep3ByteLen);
                CH554UART1SendBuffer(Ep3Buffer, Ep3ByteLen);
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 3 to ACK again
                UsbEp3ByteCount = 0;
            }

            // Check if Endpoint 4 (DEBUG) has received data
            if (UsbEp4ByteCount) {
                Ep4ByteLen = UsbEp4ByteCount; // UsbEp4ByteCount can be maximum 64 bytes
                // memcpy(UartTxBuf, Ep0Buffer+64, Ep4ByteLen); // Endpoint 4 receive is at address UEP0_DMA+64

                CH554UART1SendByte(IO_DEBUG); // Send DEBUG mode header
                CH554UART1SendByte(Ep4ByteLen); // Send length (always 64 bytes)
                // CH554UART1SendBuffer(UartTxBuf, Ep4ByteLen);
                CH554UART1SendBuffer(Ep0Buffer+64, Ep4ByteLen);
                UEP4_CTRL = (UEP4_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 4 to ACK again
                UsbEp4ByteCount = 0;
            }

            UartRxBufByteCount = uart_byte_count(); // Check amount of data in buffer

            if ((UartRxBufByteCount >= 2) && !FrameStarted) {  // If we have data and the header is not yet validated
                FrameMode = UartRxBuf[UartRxBufOutputPointer]; // Extract frame mode
                if ((FrameMode == IO_CDC)   ||
                    (FrameMode == IO_FIDO)  ||
                    (FrameMode == IO_CCID)  ||
                    (FrameMode == IO_DEBUG) ||
                    (FrameMode == IO_CH552)) {

                    FrameLength = UartRxBuf[increment_pointer(UartRxBufOutputPointer,
                                                              1,
                                                              UART_RX_BUF_SIZE)]; // Extract frame length
                    FrameRemainingBytes = FrameLength;
                    UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                               2,
                                                               UART_RX_BUF_SIZE); // Start at valid data so skip the mode and length byte
                    UartRxBufByteCount -= 2; // Subtract the frame mode and frame length bytes from the total byte count
                    FrameStarted = 1;

                    // Mark that we should discard data if destination for the frame is not active
                    if ((FrameMode & ActiveEndpoints) == 0) {
                        FrameDiscard = 1;
                    }

                } else { // Invalid frame mode

                    cts_stop();

