tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
                // Write upload endpoint
                memcpy(Ep2Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 2 */
                       FrameBuf,
                       FrameBufLength);

                Endpoint2UploadBusy = 1; // Set busy flag
                UEP2_T_LEN = FrameBufLength; // Set the number of data bytes that Endpoint 2 is ready to send
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                if (FrameBufLength == 64) {
                    // Terminate all 64-byte frames
                    CdcSendZeroLenPacket = 1;
                }

                CdcDataAvailable = 0;
                FrameBufLength = 0;

                if (FrameRemainingBytes == 0) {
                    // Complete frame sent, get next header and data
                    FrameStarted = 0;
                }
            }

            if (CdcSendZeroLenPacket && !Endpoint2UploadBusy) {
                // UEP0_CTRL = UEP_R_RES_NAK | UEP_T_RES_NAK;
                // Transmit zero-length packet to terminate 64-byte frames
                // Only applicable to CDC (bulk transfers)

                Endpoint2UploadBusy = 1; // Set busy flag
                UEP2_T_LEN = 0; // Set the number of data bytes that Endpoint 2 is ready to send
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK
                CdcSendZeroLenPacket = 0;
            }

            // Check if we should upload data to Endpoint 3 (FIDO)
            if (FidoDataAvailable && !Endpoint3UploadBusy) {
                // UEP0_CTRL = UEP_R_RES_NAK | UEP_T_RES_NAK;

                // Write upload endpoint
                memcpy(Ep3Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 3 */
                       FrameBuf,
                       FrameBufLength);

                Endpoint3UploadBusy = 1; // Set busy flag
                UEP3_T_LEN = MAX_PACKET_SIZE; // Set the number of data bytes that Endpoint 3 is ready to send
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                FidoDataAvailable = 0;
                FrameBufLength = 0;

                // Get next header and data
                FrameStarted = 0;
            }

            // Check if we should upload data to Endpoint 3 (CCID)
            if (CcidDataAvailable && !Endpoint3UploadBusy) {
                // UEP0_CTRL = UEP_R_RES_NAK | UEP_T_RES_NAK;

                // Write upload endpoint
                memcpy(Ep3Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 3 */
                       FrameBuf,
                       FrameBufLength);

                Endpoint3UploadBusy = 1; // Set busy flag
                UEP3_T_LEN = FrameBufLength; // Set the number of data bytes that Endpoint 3 is ready to send
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                CcidDataAvailable = 0;
                FrameBufLength = 0;

                // Get next header and data
                FrameStarted = 0;
            }

            // Check if we should upload data to Endpoint 4 (DEBUG)
            if (DebugDataAvailable && !Endpoint4UploadBusy) {
                // UEP0_CTRL = UEP_R_RES_NAK | UEP_T_RES_NAK;

                if (FrameBufLength == MAX_PACKET_SIZE) {
                    // Write upload endpoint
                    memcpy(Ep0Buffer + 128, /* Copy to IN (TX) buffer of Endpoint 4 */
                           FrameBuf,
                           FrameBufLength);
                } else {
                    memset(Ep0Buffer + 128, 0, MAX_PACKET_SIZE);
                    // Write upload endpoint
                    memcpy(Ep0Buffer + 128, /* Copy to IN (TX) buffer of Endpoint 4 */
                           FrameBuf,
                           FrameBufLength);
                }

                Endpoint4UploadBusy = 1; // Set busy flag
                UEP4_T_LEN = MAX_PACKET_SIZE; // Set the number of data bytes that Endpoint 4 is ready to send
                UEP4_CTRL = (UEP4_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                DebugDataAvailable = 0;
                FrameBufLength = 0;

                if (FrameRemainingBytes == 0) {
                    // Complete frame sent, get next header and data
                    FrameStarted = 0;
                }
            }

            // Check if we should handle CH552 data
            if (CH552DataAvailable) {

                // Check command range
                if (FrameBuf[0] < CH552_CMD_MAX) {
                    switch (FrameBuf[0]) {
                    case SET_ENDPOINTS:
                        cts_stop(); // Stop UART data from FPGA
                        RESET_KEEP = FrameBuf[1]; // Save endpoints to persistent register
                        SAFE_MOD = 0x55; // Start reset sequence
                        SAFE_MOD = 0xAA;
                        GLOBAL_CFG = bSW_RESET;
                        while (1)
                            ;
                        break;
                    default:
                        break;
                    } // END switch(FrameBuf[0])
                }

                CH552DataAvailable = 0;
                FrameBufLength = 0;

                memset(FrameBuf, 0, MAX_FRAME_SIZE);

                if (FrameRemainingBytes == 0) {
                    // Complete frame sent, get next header and data
                    FrameStarted = 0;
                }
            }

            if (DiscardDataAvailable) {

                DiscardDataAvailable = 0;
                printStr("Frame discarded!\n");

                if (FrameRemainingBytes == 0) {
                    // Complete frame discarded, get next header and data
                    FrameStarted = 0;
                    // Stop discarding frames
                    FrameDiscard = 0;
                }
            }

        } /* END if (UsbConfig) */
    } /* END while (1) */
}
